; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v8)
             (pred_2 ?v1 ?v13)
             (pred_5 ?v12 ?v13)
             (pred_9 ?v9 ?v12 )
	     (pred_12 ?v12)
             (pred_11 ?v7)
             (pred_6 ?v1)
             (pred_1 ?v13)
             (pred_8 ?v12)
             (pred_4 ?v1)
             (pred_10 ?v12)
             (pred_7 ))



(:action op_1
:parameters (?v6 ?v2 ?v10 ?v3)
:precondition (and (pred_11 ?v6) (pred_11 ?v2) (pred_6 ?v10) (pred_1 ?v3)
          (pred_3 ?v6 ?v2) (pred_2 ?v10 ?v3)
                   (pred_5 ?v2 ?v3) (pred_12 ?v6) 
                   (pred_8 ?v2) (pred_4 ?v10))
:effect (and  (pred_10 ?v2) (not (pred_8 ?v2))))


(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_11 ?v6) (pred_11 ?v4)
               (pred_12 ?v6) (pred_3 ?v6 ?v4) (pred_10 ?v4))
:effect (and (pred_12 ?v4) (not (pred_12 ?v6))))

(:action op_3
:parameters (?v6 ?v10)
:precondition (and (pred_11 ?v6) (pred_6 ?v10) 
                  (pred_12 ?v6) (pred_9 ?v10 ?v6) (pred_7 ))
:effect (and (pred_4 ?v10)
   (not (pred_9 ?v10 ?v6)) (not (pred_7 ))))


(:action op_5
:parameters (?v6 ?v5 ?v11)
:precondition (and (pred_11 ?v6) (pred_6 ?v5) (pred_6 ?v11)
                  (pred_12 ?v6) (pred_4 ?v11) (pred_9 ?v5 ?v6))
:effect (and (pred_4 ?v5) (pred_9 ?v11 ?v6)
        (not (pred_4 ?v11)) (not (pred_9 ?v5 ?v6))))

(:action op_2
:parameters (?v6 ?v10)
:precondition (and (pred_11 ?v6) (pred_6 ?v10) 
                  (pred_12 ?v6) (pred_4 ?v10))
:effect (and (pred_7 ) (pred_9 ?v10 ?v6) (not (pred_4 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_08 obj_18 obj_12 obj_04 obj_15 obj_11 obj_14 obj_07 obj_10 obj_02 obj_17 obj_21 obj_03 obj_01 obj_19
    obj_16 obj_20
    obj_09 obj_13 obj_05
    )

    (:init
       (pred_7)

       (pred_11 obj_06)
       (pred_11 obj_08)
       (pred_11 obj_18)
       (pred_11 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_15)
       (pred_11 obj_11)
       (pred_11 obj_14)
       (pred_11 obj_07)
       (pred_11 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_17)
       (pred_11 obj_21)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_19)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_6 obj_09)
       (pred_6 obj_13)
       (pred_6 obj_05)

       (pred_3 obj_06 obj_04)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_18 obj_11)
       (pred_3 obj_18 obj_12)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_12 obj_18)
       (pred_3 obj_04 obj_07)
       (pred_3 obj_04 obj_15)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_15 obj_10)
       (pred_3 obj_15 obj_11)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_15 obj_04)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_11 obj_15)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_07 obj_21)
       (pred_3 obj_07 obj_10)
       (pred_3 obj_07 obj_04)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_15)
       (pred_3 obj_10 obj_07)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_17)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_17 obj_02)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_21 obj_07)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_19 obj_01)
       (pred_8 obj_15)
       (pred_8 obj_07)
       (pred_8 obj_18)
       (pred_5  obj_15 obj_16)
       (pred_5  obj_07 obj_20)
       (pred_5  obj_18 obj_16)
       (pred_10 obj_06)
       (pred_10 obj_08)
       (pred_10 obj_12)
       (pred_10 obj_04)
       (pred_10 obj_11)
       (pred_10 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_21)
       (pred_10 obj_03)
       (pred_10 obj_01)
       (pred_10 obj_19)

       (pred_2  obj_09 obj_16)
       (pred_2  obj_13 obj_20)
       (pred_2  obj_05 obj_20)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_05 obj_01)
       (pred_12 obj_02)
    )

    (:goal (and
       (pred_9 obj_09 obj_10)
       (pred_9 obj_13 obj_17)
    ))
(:constraints
  (always (not (pred_12 obj_11)))
)
)

; plan
1. (op_4 obj_02 obj_17)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_17)
   goals met: 0 of 2
2. (op_4 obj_17 obj_14)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_14)
   goals met: 0 of 2
3. (op_3 obj_14 obj_13)
   deleted: (pred_9 obj_13 obj_14) (pred_7)
   added: (pred_4 obj_13)
   goals met: 0 of 2
4. (op_4 obj_14 obj_17)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_17)
   goals met: 0 of 2
5. (op_2 obj_17 obj_13)
   deleted: (pred_4 obj_13)
   added: (pred_7) (pred_9 obj_13 obj_17)
   goals met: 1 of 2
6. (op_4 obj_17 obj_14)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_14)
   goals met: 1 of 2
7. (op_4 obj_14 obj_12)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_12)
   goals met: 1 of 2
8. (op_3 obj_12 obj_09)
   deleted: (pred_9 obj_09 obj_12) (pred_7)
   added: (pred_4 obj_09)
   goals met: 1 of 2
9. (op_4 obj_12 obj_14)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_14)
   goals met: 1 of 2
10. (op_4 obj_14 obj_17)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_17)
   goals met: 1 of 2
11. (op_4 obj_17 obj_02)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_02)
   goals met: 1 of 2
12. (op_4 obj_02 obj_10)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_10)
   goals met: 1 of 2
13. (op_2 obj_10 obj_09)
   deleted: (pred_4 obj_09)
   added: (pred_7) (pred_9 obj_09 obj_10)
   goals met: 2 of 2
